[


{
  "title": "Featureentwicklung in modernen Browsern",
  "author": "Raphael Höser",
  "date": "2023-06-01 00:00:00 +0200",
  "type": "Bachelorarbeit",
  "status": "Published",
  "keywords": "WebentwicklungBrowser-KompatibilitätFeature-Unterstützung",
  "partner": "",
  "partnerUrl": "",
  "image": "",
  "relatedFolder": "",
  "abstract": "&lt;p&gt;Webentwicklung ist ein sich laufend weiterentwickelndes Feld mit einer Vielzahl an Stakeholderinnen wie Browserherstellerinnen, Standardisierungsorganisationen, Entwicklerinnen und Nutzerinnen. Diese Weiterentwicklung läuft gerade in Browsern oftmals nicht synchron ab, und so ist die tatsächliche Unterstützung, besonders für neue Features in unterschiedlichen Browsern, für Entwicklerinnen oft schwierig einzuschätzen. Diese Einschätzung ist jedoch für Entwicklerinnen relevant, da sie die Nutzung neuer Features in ihren Projekten abwägen müssen. Diese Arbeit zeigt auf, wie die Standardisierung und Umsetzung neuer Features funktioniert und wie Google Chrome eine führende Rolle einnimmt, während sich Apples Safari in den letzten Jahren verändert hat. Dies wird unter anderem durch eine Analyse historischer Kompatibilitätsdaten aus unterschiedlichen Quellen wie CanIUse erreicht. Des Weiteren zeigt diese Arbeit, welche Ansätze zur Unterstützung neuer Features in allen Browsern genutzt werden und dass Safari, entgegen einiger Behauptungen, nicht der neue Internet Explorer ist und gerade seit 2022 deutlich in der Featureunterstützung auf Google Chrome und Mozilla Firefox aufholt.&lt;/p&gt;",
  "url": "/works/-featureentwicklung-in-modernen-browsern-june-1-2023-12-00-am.html"
}
,

{
  "title": " Design und Konzeption von interaktiven Visualisierungen des Produktlebenszyklus zur Vermittlung von Nachhaltigkeit",
  "author": "Pascal Schorde",
  "date": "2023-08-17 00:00:00 +0200",
  "type": "Masterarbeit",
  "status": "",
  "keywords": "Nachhaltiger Konsum, Agenda 2030, Lebenszyklusanalyse, Visualisierung von Nachhaltigkeitsdimensionen",
  "partner": "Anna Matilda Nowak-Meitinger, Technische Universität Berlin",
  "partnerUrl": "https://www.tu.berlin/qw/ueber-uns/team",
  "image": "",
  "relatedFolder": "p-schorde",
  "abstract": "&lt;p&gt;Die Auseinandersetzung mit einem nachhaltigen Lebensstil umfasst die Beschäf- tigung mit dem individuellen Konsumverhalten. Im Kontext der Agenda 2030 der Vereinten Nation zur Erreichung der 17 Nachhaltigkeitsziele widmet sich das 12. Ziel mit nachhaltigen Produktions- und Konsummuster. Produktion und Konsum sind eng miteinander verbunden und durch globale Wertschöpfungsketten für einen Großteil des Ressourcenverbrauchs verantwortlich. Für einen nachhaltigen Konsum müssen Informationsasymmetrien zwischen Hersteller und Konsumenten überwunden werden. Die vorliegende Thesis beleuchtet diesen Themenkomplex. Mit der Design Science Research Methode werden die Themen Nachhaltigkeit, nachhaltige Entwicklung und nachhaltiger Konsum sowie der Lebenszyklus von Produkten mit den Bilanzierungs- methoden Ökobilanz und Sozialbilanz analysiert, um die vorhandenen Probleme aufzuzeigen. Ein Lösungsaspekt betrifft die Frage nach geeigneten Visualisierungen, die den komplexen Lebenszyklus mit seinen ökonomischen, ökologischen und sozialen Implikationen für Konsumenten zugänglich macht. Als Ergebnis wird eine Hierarchie des Lebenszyklus in Verbindung der Nachhaltigkeitsdimensionen und den zugrunde- liegenden Ausprägungen vorgestellt. Zu den einzelnen Ebenen werden Designmuster entworfen, die Teilaspekte des allgemeinen Lebenszyklus repräsentieren.&lt;/p&gt;",
  "url": "/works/p-schorde-design-und-konzeption-von-interaktiven-visualisierungen-des-produktlebenszyklus-zur-vermittlung-von-nachhaltigkeit-17-08-2023.html"
}
,

{
  "title": "State-of-the-Art approaches to working with sounds on the web",
  "author": "Dmitrii Kuznetsov",
  "date": "2023-09-15 00:00:00 +0200",
  "type": "Masterarbeit",
  "status": "Published",
  "keywords": "Webtechnologien, Web Audio API, Audiokomposition, interaktive Webanwendungen",
  "partner": "",
  "partnerUrl": "",
  "image": "",
  "relatedFolder": "",
  "abstract": "&lt;p&gt;Webtechnologien, und insbesondere das Frontend, haben in den letzten zehn Jahren einen enormen Entwicklungssprung gemacht. Heutzutage haben EntwicklerZugang zu verschiedenen Web-APIs, die es ihnen ermöglichen, komplexe interaktive Webanwendungen zu erstellen, die in allen modernen Browsern funktionieren. Eine davon ist die Web Audio API - ein flexibles und leistungsstarkes System, das die Audiokomposition und -verarbeitung ermöglicht. Leider gibt es nicht viele Anleitungen und technische Literatur, die sich dieser Technologie widmen, daher kann es ziemlich herausfordernd sein, zu verstehen, wie sie funktioniert. Diese Arbeit behandelt vergangene, gegenwärtige und zukünftige Ansätze zur Arbeit mit Audio im Web. Sie beschreibt die Architektur der Web Audio API, ihre Bestandteile und bietet zahlreiche Beispiele, um zu zeigen, wie man die Technologie in der Praxis anwenden kann. Diese Arbeit kann als Ausgangspunkt für eine vertiefte Untersuchung bestimmter Aspekte der Web Audio API dienen, wie beispielsweise räumlicher Klang oder die Analyse von Audiosignalen.&lt;/p&gt;",
  "url": "/works/-state-of-the-art-approaches-to-working-with-sounds-on-the-web-september-15-2023-12-00-am.html"
}
,

{
  "title": "Augmented Reality für Flutter Web: Entwicklung eines Plugins anhand eines Praxisbeispiels",
  "author": "Felix Günthner",
  "date": "2023-10-01 00:00:00 +0200",
  "type": "Bachelorarbeit",
  "status": "Published",
  "keywords": "Flutter, Augmented Reality, AR-Plugin",
  "partner": "",
  "partnerUrl": "",
  "image": "",
  "relatedFolder": "",
  "abstract": "&lt;p&gt;Im Fokus dieser Arbeit steht die Erweiterung einer existierenden Dating-App, die mit dem Cross-Plattform-Framework Flutter entwickelt wurde. Die App soll um das Feature „Virtuelle Geschenke“ mittels Augmented Reality (AR) erweitert werden. Die Arbeit adressiert das Fehlen eines AR-Plugins für Flutter Web, das AR-Erlebnisse für Flutter Web ermöglicht. Das angestrebte Ziel ist die Entwicklung eines AR-Plugins, das den spezifischen Anwendungsfall „Virtuelle Geschenke“ unterstützt und die bestehende Lücke im Flutter-Ökosystem schließt. Vor dem Hintergrund einer Prognose des mobilen AR-Markts, der bis 2026 einen Wert von über 36 Milliarden US-Dollar erreichen soll, wird das Potenzial der AR-Technologie und ihre Bedeutung für das Flutter-Ökosystem verdeutlicht.&lt;/p&gt;&lt;p&gt;Um das Ziel zu erreichen, wurde eine Anforderungserhebung durchgeführt und die Entwicklung in zwei Sprints aufgeteilt. Das Ziel konnte weitgehend erreicht werden. Es erfüllt vier von fünf funktionalen und sieben von acht nicht-funktionalen Anforderungen. Die Interaktion mit AR-Objekten und die universelle Kompatibilität mit Smartphones und Webbrowsern wurden jedoch als Einschränkungen identifiziert. Das Plugin ist hier verfügbar.&lt;/p&gt;&lt;p&gt;Die Ergebnisse dieser Arbeit erweitern die Möglichkeiten von Flutter für die Erstellung interaktiver, immersiver Web-Erlebnisse und positionieren Flutter als wichtigen Akteur im Bereich der AR-Webanwendungen. Die Arbeit unterstreicht das Potenzial von Flutter im Web-Bereich und zeigt, dass es mit etablierten Web-Frameworks konkurrieren kann. Trotz einiger Limitationen und Herausforderungen bietet die Forschungsarbeit eine solide Grundlage für zukünftige Entwicklungen und leistet einen wertvollen Beitrag zum Flutter-Ökosystem und zur Web-Entwicklung im Allgemeinen. Das entsprechende GitHub-Repository mit dem Quellcode und weiteren Informationen finden Sie hier.&lt;/p&gt;",
  "url": "/works/-augmented-reality-f%C3%BCr-flutter-web-entwicklung-eines-plugins-anhand-eines-praxisbeispiels-october-1-2023-12-00-am.html"
}
,

{
  "title": "Konzeption und Entwicklung einer Vaadin-Applikation zur Modifikation des Layouts eines Webklienten im Kontext der Mediengesellschaft RTL",
  "author": "Maxim Anton Probst",
  "date": "2023-10-06 00:00:00 +0200",
  "type": "Bachelorarbeit",
  "status": "Published",
  "keywords": "Web Frontend Development",
  "partner": "RTL Mediengruppe",
  "partnerUrl": "https://company.rtl.com/de/homepage/",
  "image": "",
  "relatedFolder": "2022-probst-maxim",
  "abstract": "&lt;p&gt;Diese Bachelorarbeit befasst sich mit der Konzeption und Entwicklung eines Layout-Editors und wurde in Zusammenarbeit mit RTL Deutschland verfasst. Diese Applikation soll dem Editieren der Nutzeroberfläche einer bestehenden Webanwendung dienen und in diese integriert werden. Ziel dieser Arbeit ist es auch, sich mit dem Vaadin-Framework auseinanderzusetzen und dessen positiven und negativen Aspekte für die Softwareentwicklung in dem gegebenen Umfeld zu analysieren. In dieser Arbeit werden die aktuellen Standards der Webentwicklung betrachtet und mit Vaadin verglichen. Dabei wird auch die Implementierung einer Drag-and-Drop-Funktionalität behandelt, die dem Anwender eine intuitive Bedienung ermöglichen soll. Zudem sollen Möglichkeiten zur Speicherung der entstehenden Daten und die Integration in das bestehende System betrachtet werden.Resultat der Arbeit ist ein funktionierender Layout-Editor, mit welchem die Oberfläche der schon bestehenden Webanwendung mittels Drag-and-Drop manipuliert werden kann. Für eine Integration in das bestehende System sind noch Anpassungen nötig. Festgestellt wurde, dass Vaadin sich besonders für Projekte eignet, welche kompakt und relativ unabhängig von anderen agieren. Wenn das Backend für mehr als nur ein Frontend entwickelt werden soll, eignet sich Vaadin eher weniger. In dem Falle wäre eine traditionelle Trennung von Backend und Frontend zu bevorzugen.&lt;/p&gt;",
  "url": "/works/2022-probst-maxim-konzeption-und-entwicklung-einer-vaadin-applikation-zur-modifikation-des-layouts-eines-webklienten-im-kontext-der-mediengesellschaft-rtl-06-10-2023.html"
}
,

{
  "title": "Konzeption und Entwicklung einer automatisierten Lösung zur Generierung von Beschreibungstexten für Wein im E-Commerce Bereich auf Basis strukturierter Produktdaten",
  "author": "Tim Loges",
  "date": "2023-10-06 00:00:00 +0200",
  "type": "Masterarbeit",
  "status": "",
  "keywords": "Automatisierte Textgenerierung, Large Language Modelle, E-Commerce Beschreibungstexte, Shopware Plugin",
  "partner": "Heiko Riffeler, gjuce GmbH",
  "partnerUrl": "https://www.gjuce.com",
  "image": "",
  "relatedFolder": "t-loges",
  "abstract": "&lt;p&gt;Die Masterarbeit befasst sich mit der Konzeption und Entwicklung einer automatisierten Lösung zur Generierung von Beschreibungstexten im E-Commerce Bereich. Die Grundlage hierfür sind strukturierte Produktdaten über Wein. Diese Arbeit zielt darauf ab, die folgenden Fragen zu beantworten: Welches Large Language Modell eignet sich am besten für die Generierung von Beschreibungstexten? Wie lassen sich automatisch generierte Beschreibungstexte bewerten? Und wie muss ein Userinterface gestaltet sein, das eine automatische Generierung ermöglicht?&lt;/p&gt;&lt;p&gt;Für das Beantworten der Forschungsfragen wurden aktuell verfügbare Large Language Modelle verglichen und eine intensive Recherche in der Thematik des Prompt Engineering durchgeführt. Des Weiteren ist ein Plugin für das Shopsystem Shopware konzipiert und implementiert worden, welches es ermöglicht, Beschreibungstexte anhand von strukturierten Produktdaten zu erstellen.&lt;/p&gt;&lt;p&gt;Die Analyse der Modelle hat ergeben, dass sich zum Zeitpunkt dieser Arbeit die Large Language Modelle von OpenAI am besten für die automatische Generierung von Beschreibungstexten eignen. Diese können sich von der Konkurrenz abgrenzen, da sie mit einer geringen Menge an strukturierten Daten konsistente und den Anforderungen entsprechende Ergebnisse liefern. Der Kurzlebigkeit der Modelle geschuldet wird das aktuellste Modell (GPT-4) für die Generierung herangezogen. Das objektive Bewerten von generierten Beschreibungstexten hat sich als herausfordernd herausgestellt. Es hat sich herausgestellt, dass für diesen Anwendungsfall keine allgemeingültigen Bewertungskriterien aufgestellt werden können. Es wurden Ansätze geschaffen, die eine Grundlage für zukünftige Untersuchungen ermöglichen.&lt;/p&gt;",
  "url": "/works/t-loges-konzeption-und-entwicklung-einer-automatisierten-l%C3%B6sung-zur-generierung-von-beschreibungstexten-f%C3%BCr-wein-im-e-commerce-bereich-auf-basis-strukturierter-produktdaten-06-10-2023.html"
}
,

{
  "title": "Vergleich von AI-Tools zur automatisierten Grafikerstellung und -ergänzung und deren Einsatz im Online-Marketing",
  "author": "Tobias Rutsch",
  "date": "2023-10-23 00:00:00 +0200",
  "type": "Bachelorarbeit",
  "status": "Published",
  "keywords": "KI-Tools, Grafikerstellung, Online-Marketing",
  "partner": "",
  "partnerUrl": "",
  "image": "",
  "relatedFolder": "",
  "abstract": "&lt;p&gt;Durch den technischen Fortschritt im Bereich der künstlichen Intelligenz werden immer mehr Tools entworfen, die durch den Einsatz von KI unterschiedliche Aufgaben erfüllen. So nimmt auch die Zahl der KI-Tools zur automatisierten Grafikerstellung und -ergänzung zu. Diese können verwendet werden, um herkömmliche Prozesse der Grafikproduktion effizienter zu gestalten. Auch im Online-Marketing werden Grafiken eingesetzt, um verschiedene Zwecke zu erfüllen. Das Ziel der vorliegenden Arbeit ist es, herauszustellen, in welchen Fällen die Verwendung eines KI-Tools zur automatisierten Grafikerstellung und -ergänzung im Kontext des Online-Marketings sinnvoll sein kann. Dafür werden die Einsatzgebiete von Grafiken im Online-Marketing recherchiert und herausgestellt, welche Bearbeitungsschritte dabei vorkommen. Anschließend werden anhand dessen Anwendungsszenarien definiert, die unter Verwendung unterschiedlicher KI-Tools zur automatisierten Grafikerstellung und -ergänzung praktisch umgesetzt werden. Der Vorgang wird dabei dokumentiert und anschließend ausgewertet. Dabei erweisen sich die KI-Tools in vielen Bereichen durchaus als geeignet oder zumindest hilfreich. Im direkten Vergleich der untersuchten Tools konnten die Tools von Adobe (Generative AI und Firefly) am besten abschließen. Diese konnten die meisten Anwendungsszenarien zufriedenstellend und effizient umsetzen und empfehlen sich dadurch am meisten für die Verwendung im Kontext der Grafikerstellung und -ergänzung im Online-Marketing.&lt;/p&gt;&lt;p&gt;Aufgrund vieler Limitierungen der Untersuchung dient diese Untersuchung lediglich als oberflächliche oder stichprobenartige Einschätzung der Situation. Weiterführende Forschungen mit weiteren unterschiedlichen Anwendungsszenarien, der Berücksichtigung weiterer Tools und weiteren Nutzern, die die Umsetzung der Anwendungsszenarien durchführen, könnten weitaus detailliertere Ergebnisse liefern.&lt;/p&gt;",
  "url": "/works/asas-vergleich-von-ai-tools-zur-automatisierten-grafikerstellung-und-erg-%CC%88anzung-und-deren-einsatz-im-online-marketing-october-23-2023-12-00-am.html"
}
,

{
  "title": "Konzeption und Entwicklung eines Plugins zur automatisierten Moderation von Textinhalten durch KI für die WoltLab Suite Community Software",
  "author": " Moritz Hendrik Levin Dahlke",
  "date": "2023-11-01 00:00:00 +0100",
  "type": "Bachelorarbeit",
  "status": "Published",
  "keywords": "Moderation nutzergenerierter Inhalte, Sprachmodelle, automatisierte Inhaltsmoderation, künstliche Intelligenz",
  "partner": "",
  "partnerUrl": "",
  "image": "",
  "relatedFolder": "",
  "abstract": "&lt;p&gt;Die Moderation von nutzergenerierten Inhalten im Internet ist eine wichtige, aber auch sehr aufwändige Aufgabe. Diese Arbeit thematisiert, wie Sprachmodelle den Prozess der Inhaltsmoderation vereinfachen und automatisieren können. Das Ziel der vorliegenden Arbeit war es, zu überprüfen, ob und wie eine automatisierte Moderation von nutzergenerierten Inhalten durch Sprachmodelle funktioniert und implementiert werden kann. Dabei sollte ermittelt werden, welche Ergebnisse damit erzielt werden können, ob sich Sprachmodelle im Allgemeinen für diesen Zweck eignen und ob künstliche Intelligenz die Moderation von nutzergenerierten Inhalten zukünftig vollständig übernehmen kann. Zur Demonstration der automatisierten Inhaltsmoderation durch Sprachmodelle wurde im Rahmen dieser Arbeit ein Plugin für die WoltLab Suite Community Software konzipiert und entwickelt, welches verschiedene Anwendungsfälle für Inhaltsmoderation mit Hilfe der von OpenAI zur Verfügung gestellten Schnittstelle zur Nutzung von GPT-Modellen realisiert. Die Evaluation des entwickelten Plugins hat ergeben, dass sich Sprachmodelle für die automatisierte Inhaltsmoderation eignen und bereits jetzt eine gute Alternative oder Ergänzung zu herkömmlichen Moderationsmethoden darstellen.&lt;/p&gt;",
  "url": "/works/-konzeption-und-entwicklung-eines-plugins-zur-automatisierten-moderation-von-textinhalten-durch-ki-f%C3%BCr-die-woltlab-suite-community-software-november-1-2023-12-00-am.html"
}
,

{
  "title": " Strategien und Methoden zur Reduzierung des Energieverbrauchs in Webanwendungen",
  "author": "Jan Koll",
  "date": "2024-01-15 00:00:00 +0100",
  "type": "Masterarbeit",
  "status": "Published",
  "keywords": "Energieeffizienz, Webanwendungen, Energieverbrauch",
  "partner": "",
  "partnerUrl": "",
  "image": "",
  "relatedFolder": "",
  "abstract": "&lt;p&gt;In einer zunehmend digitalisierten Welt, in der das Internet signifikant zum Energieverbrauch beiträgt, untersucht diese Arbeit Strategien zur Reduzierung des Energieverbrauchs in Webanwendungen. Unter Berücksichtigung von Literatur aus Regierungs- und Umweltverbänden analysiert sie energieintensive Aspekte von Webtechnologien und entwickelt energieeffiziente Lösungen. Zentrale Prinzipien sind die Minimierung der Datenmenge und die Maximierung der Prozessgeschwindigkeit. Das Ziel ist, einen Beitrag zur Energieeffizienz im IT-Sektor zu leisten und so zur Erreichung des Pariser 1,5-Grad-Ziels beizutragen.&lt;/p&gt;",
  "url": "/works/-strategien-und-methoden-zur-reduzierung-des-energieverbrauchs-in-webanwendungen-january-15-2024-12-00-am.html"
}
,

{
  "title": "Partizipative Weiterentwicklung und Veröffentlichung eines geräteübergreifenden Browserspiels als Open-Source-Projekt",
  "author": "Florian Michel Berghahn",
  "date": "2024-05-04 00:00:00 +0200",
  "type": "Bachelorarbeit",
  "status": "Published",
  "keywords": "Gerätegrenzenübergreifende Browserspiele, partizipativer Entwicklungsprozess, Open-Source-Software, Websockets, WebGL",
  "partner": "",
  "partnerUrl": "",
  "image": "/assets/uploads/final-blockdown.webp",
  "relatedFolder": "",
  "abstract": "&lt;p&gt;Angesichts der wachsenden Bedeutung verteilter Systeme, der vielfältigen Nutzung von Multimedia-Inhalten auf unterschiedlichen Geräten und der fortlaufenden Weiterentwicklung von Browsern wird die Relevanz deutlich, das Potenzial von geräteübergreifenden Browserspielen zu untersuchen.&lt;/p&gt;&lt;p&gt;Das Ziel dieser Arbeit besteht darin, den im vorangegangenen Praxisprojekt entwickelten Prototyp des Spiels „Finalblockdown“ durch einen partizipativen Prozess weiterzuentwickeln und schließlich als Open-Source-Software zu veröffentlichen. Das direkte Einbeziehen ausgewählter Testnutzer in die Weiterentwicklung des Spiels zielt darauf ab, das Spielerlebnis, die technische Leistung sowie die Benutzerfreundlichkeit umfassend und nutzerorientiert zu verbessern.&lt;/p&gt;&lt;p&gt;Zur Durchführung des partizipativen Prozesses wurden mehrere Fokusgruppen gebildet, die während der gesamten Entwicklung aktiv mitwirkten und jede Iteration eingehend testeten sowie evaluierten. Die Testläufe waren eine Kombination aus Play-Testing und Gruppeninterviews, die zur Auswertung mitgeschnitten wurden. Basierend auf dem dokumentierten, zusammengetragenen und eingestuften Feedback aller Gruppen wurde ein Entwicklungsplan für die jeweilige Iteration erstellt.&lt;/p&gt;&lt;p&gt;Der partizipative Prozess brachte signifikante Vorteile, insbesondere im Hinblick auf die Gestaltung der Benutzeroberfläche, Spielmechaniken und des Testens. Limitierungen durch begrenzte Zeit und Ressourcen zeigen jedoch, dass der partizipative Ansatz zeitintensiv ist, was in der Planung berücksichtigt werden muss.&lt;/p&gt;&lt;p&gt;Durch den Prozess wurde ein visuell und spielerisch überzeugendes Spiel entwickelt, das komplexe Programmierkonzepte wie Websockets, WebGL-Grafiken und Spatial Hashing in Vanilla JavaScript umgesetzt hat und durch eigenes Hosting veröffentlicht wurde. Trotzdem hat das System noch umfangreiches Optimierungs- und Entwicklungspotenzial, weswegen es sich gut als Open-Source-Software eignet und so über den Projektrahmen hinaus weiterentwickelt werden wird.&lt;/p&gt;&lt;p&gt;Weiterführende Forschungen könnten sich sowohl auf prozessbezogene als auch auf technische Aspekte konzentrieren. In der Weiterentwicklung des partizipativen Prozesses könnte man analysieren, wie die Einbindung von Testnutzern in komplexe Bereiche der Entwicklung, einschließlich Systemarchitektur und Leistung, die Demokratisierung des Designs verstärken könnte. Technische Untersuchungen könnten sich darauf konzentrieren, wie Optimierungen in den Bereichen Hosting, Websockets und Kollisionserkennung zur Leistungssteigerung des Systems beitragen können.&lt;/p&gt;",
  "url": "/works/-partizipative-weiterentwicklung-und-ver%C2%A8-offentlichung-eines-ger-%C2%A8-ate%C2%A8-ubergreifenden-browserspiels-als-open-source-projekt-may-4-2024-12-00-am.html"
}
,

{
  "title": "Wie man Kunst online für Interessierte mithilfe von WebVR erlebbar machen kann: WebVR Erlebnisraum am Beispiel des Cranach Digital Archive",
  "author": "Valeria Orlova",
  "date": "2024-06-03 00:00:00 +0200",
  "type": "Masterarbeit",
  "status": "Published",
  "keywords": "WebVR, Cranach Digital Archive, UX, Playful Experience",
  "partner": "",
  "partnerUrl": "",
  "image": "/assets/uploads/c.noss_a_lucas_cranach_exibition_with_paintings_which_are_prese_63eaa10b-fca7-461f-9ea0-ac4dac887979.jpg",
  "relatedFolder": "",
  "abstract": "&lt;p&gt;Das Ziel dieser Masterarbeit ist es, ein Konzept für eine WebVR-Applikation zu entwickeln, das die Inhalte zu den digitalisierten Gemälden im Cranach Digital Archive auf spannende Weise an Kunstinteressierte vermitteln kann. Hierzu beinhalteten die Forschungsfragen, inwieweit WebVR eingesetzt werden kann, um eine attraktive sowie stimulierende Erfahrung bei der Entdeckung und Erforschung digitalisierter Kunstwerke zu ermöglichen, wie Interaktionselemente in Virtual Reality so gestaltet werden können, dass diese Kunst für Interessierte greifbarer machen und lehrreiche Inhalte spannend vermitteln können, und inwieweit der dreidimensionale Raum in Virtual Reality effektiv genutzt werden kann, um Kunst auf spannende Weise an Interessierte zu vermitteln.&lt;/p&gt;&lt;p&gt;Um Antworten auf diese Fragen zu finden, wurden mithilfe von Design Thinking Prozessen zehn Konzepte entwickelt, die in einer Befragung bewertet wurden. Aus diesen Konzepten wurde das beliebteste zu einem Prototypen weiterentwickelt, welcher abschließend mit den Zielgruppen getestet wurde. Die Auswertungen der Umfrage sowie des Tests zeigten, dass die Simulation einer traditionellen Kunstgalerie in virtueller Realität keinen Mehrwert für das Publikum bietet und die meisten Personen es bevorzugen, vor Ort reale Ausstellungen zu besuchen. Nutzt man jedoch den virtuellen Raum sowie die hohe Zugänglichkeit von WebVR, um dem Publikum neue Interaktionsmöglichkeiten im Kontext von Kunstausstellungen zu bieten und die Atmosphäre angenehm zu gestalten, so eignet sich ein VR-Erlebnis als gute Alternative, falls die Kunst schwer zugänglich ist.&lt;/p&gt;",
  "url": "/works/-wie-man-kunst-online-f%C3%BCr-interessierte-mithilfe-von-webvr-erlebbar-machen-kann-webvr-erlebnisraum-am-beispiel-des-cranach-digital-archive-june-3-2024-12-00-am.html"
}
,

{
  "title": "Clientseitige Generierung von PDF-Dokumenten aus Webinhalten mit HTML-Markup und CSS-Layout",
  "author": "Benedikt Engel",
  "date": "2024-06-11 00:00:00 +0200",
  "type": "Masterarbeit",
  "status": "Published",
  "keywords": "PDF-Generierung, HTML-Markup, CSS-Layout, clientseitige Bibliothek",
  "partner": "",
  "partnerUrl": "",
  "image": "/assets/uploads/c.noss_a_teaser_image_for_a_html_to_pdf_library_where_images_an_63c0185b-ad0b-47b4-851c-0369af67b964.jpg",
  "relatedFolder": "",
  "abstract": "&lt;p&gt;Diese Arbeit untersucht die clientseitige Generierung von PDF-Dokumenten aus HTML-Markup und CSS-Layout. Der Ansatz zielt darauf ab, den Pflegeprozess von Webinhalten und PDF-Dokumenten zu vereinfachen, indem Informationen im Webinhalt angegeben werden und aus diesem bei Bedarf das PDF-Dokument generiert werden kann. Zum einen werden die zum Zeitpunkt dieser Arbeit vorhandenen Technologien und Möglichkeiten zur clientseitigen Generierung betrachtet und auf ihre Vor- und Nachteile untersucht. Dabei zeigt sich, dass für alle Möglichkeiten Nachteile bestehen, welche bei einer Nutzung beachtet werden müssen. Zum anderen wurde untersucht, wie sich eine Bibliothek entwickeln lässt, welche die ermittelten Nachteile minimiert. Es wird dabei die Teilfrage beantwortet, wie sich der Inhalt und das Layout von HTML-Elementen in PDF-Dokumenten abbilden lassen. Es wird gezeigt, wie sich Texte aus Webinhalten zeilenweise auslesen und mit den angewendeten CSS-Regeln in ein PDF-Dokument übertragen lassen. Des Weiteren wird auf Möglichkeiten des Transfers von Hintergründen und Umrandungen von Elementen eingegangen. Zudem wird gezeigt, wie sich aus dem Webinhalt die Document Outlines generieren lassen, welche ein Inhaltsverzeichnis des Dokuments darstellen, und wie eine Möglichkeit für Kopf- und Fußzeilen, welche in der Regel in Dokumenten genutzt werden, umgesetzt werden können, ohne dass diese in dem Webinhalt dargestellt werden.&lt;/p&gt;",
  "url": "/works/-clientseitige-generierung-von-pdf-dokumenten-aus-webinhalten-mit-html-markup-und-css-layout-june-11-2024-12-00-am.html"
}
,

{
  "title": "Can I CAI? Entwicklung einer Webapp zur Überprüfung von Veröffentlichungsprozessen auf Kompatibilität mit aufkommenden Standards der Content Authenticity Initiative zur Auszeichnung von authentischen Medien im Web.",
  "author": "Nils Polarek",
  "date": "2024-07-23 00:00:00 +0200",
  "type": "Bachelorarbeit",
  "status": "Published",
  "keywords": "Content Authenticity Initiative (CAI), Generative künstliche Intelligenz, Authentizität",
  "partner": "",
  "partnerUrl": "",
  "image": "/assets/uploads/polarek-nils-ba-ss24-bilddokumentation-13-s.webp",
  "relatedFolder": "n-pola",
  "abstract": "&lt;p&gt;Durch rapide Fortschritte im Bereich der generativen künstlichen Intelligenz wird es zunehmend schwerer für Nutzer:innen echte Inhalte von solchen zu unterscheiden, die generiert oder manipuliert wurden. Dies kann zur bewussten oder unabsichtlichen Verbreitung von Falschinformationen führen, welche Nutzer in ihrer Wahrnehmung der Realität beeinflussen können. Aus diesem Grund wurde die Content Authenticity Initiative (CAI) gegründet, welche in Zusammenarbeit mit der Coalition for Content Provenance and Authenticity (C2PA) an Open-Source-Standards und Werkzeugen zur Auszeichnung und Überprüfung von beweisbar authentischen Inhalten im Web arbeitet. Diese Standards und deren Problemfeld gewinnen zunehmend an Bedeutung, sodass sie von Kameraherstellern wie Leica und Sony, Softwareherstellern wie Adobe und Social-Media-Plattformen wie TikTok bereits integriert werden. Damit es mehr authentische Inhalte im Web geben kann, müssen diese Standards von Medienschaffenden adaptiert werden. Dies gestaltet sich zum aktuellen Zeitpunkt allerdings noch als herausfordernd, da die Verbreitung der Standards zwar zunimmt, aber noch in einer frühen Phase ist, sodass nur wenige Geräte und Programme kompatibel sind und Informationen zur Kompatibilität von Hard- und Software nicht zentral verfügbar sind.&lt;/p&gt;&lt;p&gt;Diese Arbeit beschäftigt sich mit der Gestaltung und Umsetzung einer Open-Source-Webapp, welche es Medienschaffenden ermöglicht, ihren individuellen Veröffentlichungsprozess hinsichtlich der Kompatibilität mit den Standards der CAI zu überprüfen. In dieser Webapp kann ein solcher Prozess interaktiv aus verschiedenen Bestandteilen zusammengestellt werden und es wird aufgezeigt, welche Bestandteile kompatibel sind und welche die Kette von aufeinander aufbauenden Metadaten unterbrechen würden.&lt;/p&gt;&lt;p&gt;Hierbei liegt neben der Gestaltung und Umsetzung der Anwendung ein besonderer Fokus auf der Erstellung eines Systems zur Pflege der benötigten Datenbasis im Kontext einer Open-Source-Anwendung, sodass andere Beteiligte diese erweitern und bearbeiten können, der Erstellung eines interaktiven Prozess-Editors und der Adaption dieses in eine mobile Version mit Integration von Touchinteraktionen und -gesten.&lt;/p&gt;&lt;p&gt;Das Ergebnis dieser Arbeit ist eine für Desktop- und Mobilgeräte optimierte Webapp, welche unter https://www.can-i-cai.de erreichbar ist.&lt;/p&gt;",
  "url": "/works/n-pola-can-i-cai.html"
}
,

{
  "title": "Explorative Konzeption und Implementierung einer web-basierten Plattform zur musikalischen Echtzeit- Kollaboration an Modular-Synthesizern",
  "author": "Sebastian Brock",
  "date": "2024-08-05 00:00:00 +0200",
  "type": "Masterarbeit",
  "status": "Published",
  "keywords": "Echtzeit-Kollaboration, Modular-Synthesizer, digitale Klangerzeugung, Remote-Kollaboration",
  "partner": "",
  "partnerUrl": "",
  "image": "/assets/uploads/sbrock_2_kollaboration-s.webp",
  "relatedFolder": "2024-brock-sebastian",
  "abstract": "&lt;p&gt;Diese Arbeit untersucht die Konzeption und Implementierung einer webbasierten Plattform für die musikalische Echtzeit-Kollaboration an Modular-Synthesizern. Traditionelle musikalische Zusammenarbeit erfordert in der Regel die Anwesenheit aller Teilnehmeram gleichen Ort. Während bereits Softwarelösungen für Kontexte wie Remote-Proben von Bands existieren, lösen diese nicht die einzigartigen Herausforderungen, welche von hoch individualisierbaren Instrumenten wie Modular-Synthesizern ausgehen. Synthesizer dieser Art sind hochgradig anpassbar, wodurch jedes Setup einzigartig sein kann. Zusätzlich macht ihre analoge Bauweise die genaue Replikation von Einstellungen zwischen entfernten Systemen in der Praxis nahezu unmöglich.&lt;/p&gt;&lt;p&gt;Das Hauptziel dieses Projekts ist die Entwicklung eines Systems, welches eine kollaborative Klangerzeugung mit Modular-Synthesizern über das Web ermöglicht. Dies erfordert nicht nur technische Lösungen für die Klangerzeugung, sondern auch Strategien zur Synchronisierung mehrerer Sitzungen in Echtzeit unter Berücksichtigung der Herausforderungen von Web-Architekturen und Latenz.&lt;/p&gt;&lt;p&gt;Das Projekt verfolgt sowohl in der Konzeption als auch in der Implementierung einen explorativen Ansatz, sodass technische Möglichkeiten durch die praktische Anwendung bewertet werden können. Zentrale Aufgaben umfassen die Grundlagenforschung zur webbasierten Klangerzeugung, die Überprüfung bestehender Lösungen und die Entwicklung einer funktionalen Plattform, die eine virtuelle Zusammenarbeit an Modular-Synthesizern ermöglicht.&lt;/p&gt;&lt;p&gt;Herausforderungen wie die Minimierung der Latenz und die inhärenten Einschränkungen digitaler Simulationen im Vergleich zu ihren analogen Gegenstücken werden adressiert. Das Projekt zielt darauf ab, Erkenntnisse zu liefern, die nicht nur für die musikalische Kollaboration relevant sind, sondern auch auf andere Bereiche anwendbar sind, die eine Echtzeit-Interaktion über das Web erfordern.&lt;/p&gt;&lt;p&gt;Das praktische Ergebnis dieser Arbeit ist ein funktionsfähiges, webbasiertes System für die synchrone Zusammenarbeit an einem virtuellen Modular-Synthesizer. Die während des Projekts gewonnenen Erkenntnisse und entwickelten Methoden werden dokumentiert und bieten Beiträge zu den Bereichen Webentwicklung, digitale Klangerzeugung und Technologien für die Remote-Kollaboration.&lt;/p&gt;",
  "url": "/works/-explorative-konzeption-und-implementierung-einer-web-basierten-plattform-zur-musikalischen-echtzeit-kollaboration-an-modular-synthesizern-august-5-2024-12-00-am.html"
}


]
